InformationRegisters/сабХронометраж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>сабХронометраж</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаИзменениеУсловийКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаТорговлю</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_КорректировкаДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПеремещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыПеремещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСОбособленногоПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаПредприятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаПредприятиеБезВозмещения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Д_ОбращенияВТехПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_ОбращенияВТехПоддержку</Name>
			<BasedOn>
				<xr:Item>Document.Д_ОбращенияВТехПоддержку</xr:Item>
				<xr:Item>Document.БП_Поручение</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийБизнесПроцесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГиперСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндикаторВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БП_ВажностьПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКСроку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтИмени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьИзОтчетаОПроделаннойРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФорматированный</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализоватьВЯдре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСогласование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СубъектСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДетализацияРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыявленныеБаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеБага</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Критичность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДобавляемыеВДоступИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/сабОбщегоНазначенияПереопределяемый/Ext/Module.bsl
Процедура ДействияПриСозданииФормыСправочника(Форма, Параметры = Неопределено) экспорт
		
КонецПроцедуры

Процедура ДействияПриСозданииФормыДокумента(Форма, Объект) экспорт
	
	ДонастроитьФункционалДокументовТМЦ(Форма, Объект);
		
КонецПроцедуры

Процедура ДонастроитьФункционалДокументовТМЦ(Форма, Объект)
	Если НЕ Объект = Неопределено И Объект.Свойство("Ссылка") Тогда
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УЧ_ПеремещениеТоваров") Тогда
			Форма.Элементы.ВидОперации.РежимВыбораИзСписка = Истина;
			Форма.Элементы.ВидОперации.СписокВыбора.Очистить();
			Форма.Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПеремещений.Перемещение"));
			Форма.Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПеремещений.ПеремещениеНаПредприятие"));
			Форма.Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПеремещений.ПеремещениеНаПредприятиеБезВозмещения"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДозаполнитьНоваяЗадача(Задача, Исполнитель, Заголовок, БП, ТочкаМаршрутаБизнесПроцесса, ВозвратСсылки = Ложь, Предприятие = "", ДокументОбязательныйКПрикреплению = Неопределено, ВРаботе = Ложь, СтрокаТЧБП = Неопределено) Экспорт
	
	Попытка
		Задача.Предприятие = БП.Заявка.Предприятие;	
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Предприятие) Тогда
		Задача.Предприятие = Предприятие;	
	КонецЕсли;
	
	Если ТипЗнч(БП) = Тип("БизнесПроцессСсылка.ЗаявкиАдминистратору") Тогда
		Попытка
			Задача.Проект = Документы.Д_ОбращенияВТехПоддержку.ПолучитьРПервогоРодителяПроекта(БП.Заявка.Проект);	
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

Процедура ЗапросНаДоступныеПроекты(Запрос) Экспорт
	
	Запрос.Текст = "ВЫБРАТЬ
		|	Проекты.Ссылка КАК Родитель0,
		|	Проекты.Родитель КАК Родитель1,
		|	Проекты.Родитель.Родитель КАК Родитель2,
		|	Проекты.Родитель.Родитель.Родитель КАК Родитель3,
		|	Проекты.Родитель.Родитель.Родитель.Родитель КАК Родитель4,
		|	Проекты.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель5
		|ПОМЕСТИТЬ Родители
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Родители.Родитель5 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ИЛИ Родители.Родитель5 ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА Родители.Родитель4 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|							ИЛИ Родители.Родитель4 ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА Родители.Родитель3 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|										ИЛИ Родители.Родитель3 ЕСТЬ NULL
		|									ТОГДА ВЫБОР
		|											КОГДА Родители.Родитель2 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|													ИЛИ Родители.Родитель2 ЕСТЬ NULL
		|												ТОГДА ВЫБОР
		|														КОГДА Родители.Родитель1 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|																ИЛИ Родители.Родитель1 ЕСТЬ NULL
		|															ТОГДА Родители.Родитель0
		|														ИНАЧЕ Родители.Родитель1
		|													КОНЕЦ
		|											ИНАЧЕ Родители.Родитель2
		|										КОНЕЦ
		|								ИНАЧЕ Родители.Родитель3
		|							КОНЕЦ
		|					ИНАЧЕ Родители.Родитель4
		|				КОНЕЦ
		|		ИНАЧЕ Родители.Родитель5
		|	КОНЕЦ КАК Родитель
		|ПОМЕСТИТЬ Род
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Родители КАК Родители
		|		ПО (Проекты.Ссылка = Родители.Родитель0
		|				ИЛИ Проекты.Ссылка = Родители.Родитель1
		|				ИЛИ Проекты.Ссылка = Родители.Родитель2
		|				ИЛИ Проекты.Ссылка = Родители.Родитель3
		|				ИЛИ Проекты.Ссылка = Родители.Родитель4
		|				ИЛИ Проекты.Ссылка = Родители.Родитель5)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Родители.Родитель5 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ИЛИ Родители.Родитель5 ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА Родители.Родитель4 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|							ИЛИ Родители.Родитель4 ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА Родители.Родитель3 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|										ИЛИ Родители.Родитель3 ЕСТЬ NULL
		|									ТОГДА ВЫБОР
		|											КОГДА Родители.Родитель2 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|													ИЛИ Родители.Родитель2 ЕСТЬ NULL
		|												ТОГДА ВЫБОР
		|														КОГДА Родители.Родитель1 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|																ИЛИ Родители.Родитель1 ЕСТЬ NULL
		|															ТОГДА Родители.Родитель0
		|														ИНАЧЕ Родители.Родитель1
		|													КОНЕЦ
		|											ИНАЧЕ Родители.Родитель2
		|										КОНЕЦ
		|								ИНАЧЕ Родители.Родитель3
		|							КОНЕЦ
		|					ИНАЧЕ Родители.Родитель4
		|				КОНЕЦ
		|		ИНАЧЕ Родители.Родитель5
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Род.Родитель КАК Родитель,
		|	ЕСТЬNULL(сабХронометражСрезПоследних.ДатаНачалаРабот, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРабот
		|ИЗ
		|	Род КАК Род
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сабХронометраж.СрезПоследних КАК сабХронометражСрезПоследних
		|		ПО Род.Родитель = сабХронометражСрезПоследних.Предмет
		|			И (сабХронометражСрезПоследних.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	(Род.Родитель.ДатаОкончания > &ТекущаяДата
		|			ИЛИ Род.Родитель.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родитель
		|АВТОУПОРЯДОЧИВАНИЕ";

	

КонецПроцедуры // ()
